[Timeout] BlockStatement
src/app.js:11:34
 app.use(express.json());
 
 // Health Check
-app.get('/health', (req, res) => {
-    res.status(200).json({ status: 'UP' });
-});
+app.get('/health', (req, res) => {});
 
 // THE NEW ROUTE (The "Mouth")

[Killed] ObjectLiteral
src/app.js:12:26
 
 // Health Check
 app.get('/health', (req, res) => {
-    res.status(200).json({ status: 'UP' });
+    res.status(200).json({});
 });
 
killedBy: API Integration Tests GET /health should return 200 OK
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "UP"
Received: undefined

[Killed] BlockStatement
src/app.js:16:50
 });
 
 // THE NEW ROUTE (The "Mouth")
-app.post('/api/pricing/calculate', (req, res) => {
-    // 1. Get data from the request
-    const { basePrice, userType, occupancy } = req.body;
-    
-    // 2. Ask the "Brain" to calculate the price
-    const price = calculatePrice(basePrice, userType, occupancy);
-    
-    // 3. Send the answer back
-    res.status(200).json({ finalPrice: price });
-});
+app.post('/api/pricing/calculate', (req, res) => {});
 
 module.exports = app;
killedBy: API Integration Tests POST /api/pricing/calculate should return correct price
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
