[Killed] BlockStatement
src/services/pricingService.js:1:60
-const calculatePrice = (basePrice, userType, occupancy) => {
-    let finalPrice = basePrice;
-
-    // Rule 1: Surge Pricing (If occupancy > 80%, increase price by 20%)
-    if (occupancy > 0.80) {
-        finalPrice = finalPrice * 1.20;
-    }
-
-    // Rule 2: Premium Discount (Apply after surge pricing)
-    if (userType === 'PREMIUM') {
-        finalPrice = finalPrice * 0.90; // 10% discount
-    }
-
-    return finalPrice;
-};
+const calculatePrice = (basePrice, userType, occupancy) => {};
 
 module.exports = { calculatePrice };
killedBy: Pricing Service Rules Standard membership should pay base price
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Killed] BlockStatement
src/services/pricingService.js:5:27
     let finalPrice = basePrice;
 
     // Rule 1: Surge Pricing (If occupancy > 80%, increase price by 20%)
-    if (occupancy > 0.80) {
-        finalPrice = finalPrice * 1.20;
-    }
+    if (occupancy > 0.80) {}
 
     // Rule 2: Premium Discount (Apply after surge pricing)
killedBy: Pricing Service Rules Should increase price by 20% if capacity is over 80%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 100

[Killed] EqualityOperator
src/services/pricingService.js:5:9
     let finalPrice = basePrice;
 
     // Rule 1: Surge Pricing (If occupancy > 80%, increase price by 20%)
-    if (occupancy > 0.80) {
+    if (occupancy >= 0.80) {
         finalPrice = finalPrice * 1.20;
     }
killedBy: Pricing Service Rules Should NOT increase price if capacity is exactly 80%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 120

[Killed] ArithmeticOperator
src/services/pricingService.js:6:22
 
     // Rule 1: Surge Pricing (If occupancy > 80%, increase price by 20%)
     if (occupancy > 0.80) {
-        finalPrice = finalPrice * 1.20;
+        finalPrice = finalPrice / 1.20;
     }
 
killedBy: Pricing Service Rules Should increase price by 20% if capacity is over 80%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 83.33333333333334

[Killed] ConditionalExpression
src/services/pricingService.js:10:9
     }
 
     // Rule 2: Premium Discount (Apply after surge pricing)
-    if (userType === 'PREMIUM') {
+    if (false) {
         finalPrice = finalPrice * 0.90; // 10% discount
     }
killedBy: API Integration Tests POST /api/pricing/calculate should return correct price
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 90
Received: 100

[Killed] ConditionalExpression
src/services/pricingService.js:10:9
     }
 
     // Rule 2: Premium Discount (Apply after surge pricing)
-    if (userType === 'PREMIUM') {
+    if (true) {
         finalPrice = finalPrice * 0.90; // 10% discount
     }
killedBy: Pricing Service Rules Standard membership should pay base price
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 90

[Killed] ArithmeticOperator
src/services/pricingService.js:11:22
 
     // Rule 2: Premium Discount (Apply after surge pricing)
     if (userType === 'PREMIUM') {
-        finalPrice = finalPrice * 0.90; // 10% discount
+        finalPrice = finalPrice / 0.90; // 10% discount
     }
 
killedBy: Pricing Service Rules Premium membership should get 10% discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 90
Received: 111.11111111111111
